# AddGroundConductorSize Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..AddGroundConductorSize Method
WireMaterialType Class See Also
---
Add new electrical ground conductor size type into this material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GroundConductorSize AddGroundConductorSize(
	long ampacity,
	string size
)
```

Visual Basic
---
```text
Public Function AddGroundConductorSize ( _
	ampacity As Long, _
	size As String _
) As GroundConductorSize
```

Visual C++
---
```text
public:
GroundConductorSize^ AddGroundConductorSize(
	long long ampacity,
	String^ size
)
```

# ### Parameters
ampacity
    Type: System..::..Int64Ampacity of ground conductor size to be added.
size
    Type: System..::..StringSize of ground conductor size to be added.
# ### Return Value
New added ground conductor size.
# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace